tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Spell checker with better logic than ispell
brew "aspell"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Shell extension to jump to frequently used directories
brew "autojump"
# Collection of portable C++ source libraries
brew "boost"
# Freely available high-quality data compressor
brew "bzip2"
# Library for processing command-line flags
brew "gflags"
# Application-level logging library
brew "glog"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Compression/decompression library aiming for high speed
brew "snappy"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Implementation of extended-Rice lossless compression algorithm
brew "szip"
# File format designed to store large amounts of data
brew "hdf5"
# Key-value storage library with ordered mapping
brew "leveldb"
# Lightning memory-mapped database: key-value data store
brew "lmdb"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Open source computer vision library
brew "opencv"
# Fast open framework for deep learning
brew "caffe"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Command-line tool for getting & setting the default browser
brew "defaultbrowser"
# Modern replacement for 'ls'
brew "exa"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Remote repository management made easy
brew "ghq"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# AVH edition of git-flow
brew "git-flow-avh"
# Simple and efficient way to access statistics in git
brew "git-quick-stats"
# Improved top (interactive process viewer)
brew "htop"
# YAML Parser
brew "libyaml"
# Rainbows and unicorns in your console!
brew "lolcat"
# Utility for directing compilation
brew "make"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Simplistic interactive filtering tool
brew "peco"
# General-purpose scripting language
brew "php"
# Object-relational database system
brew "postgresql"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.7"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Tool to create Python bindings for C and C++ libraries
brew "sip"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Cross-shell prompt for astronauts
brew "starship"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Linear algebra library for many-core architectures and multi-core CPUs
brew "viennacl"
# General-purpose lossless data-compression library
brew "zlib"
# Sci-fi themed terminal emulator and system monitor
cask "edex-ui"
# Calculator and converter application
cask "numi"


